#  Homework #1
 Work to be done in this Jupyter Notebook and .pynb file turned in.   
 For full credit, all work must be shown.  
 Helpful Pandas Documentation: https://pandas.pydata.org/pandas-docs/stable/

### 1. Download Kaggle Titanic Data
https://www.kaggle.com/c/titanic/data

In [1]:
import pandas as pd
import numpy as np
import sklearn
import matplotlib.pyplot as plt
df = pd.read_csv("train.csv")

### 2. Create a Pandas DataFrame from the train.csv file

In [2]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### 3. How many rows are in the DataFrame ?

In [5]:
df.shape

(891, 12)

### 4. Using pandas, determine the min, max, median, and mean age of passengers in the training dataset?

In [141]:
#Pandas Min
df['Age'].min()

0.42

In [142]:
#Pandas Max
df['Age'].max()

80.0

In [143]:
#Pandas Median
df['Age'].median()

28.0

In [144]:
#Pandas Mean
df['Age'].mean()

29.69911764705882

### 5. Using pandas, determine the average age and fare paid for males?  Females?

In [148]:
# Male Average Age
df1 = df.loc[df['Sex']=='male']
MaleAvgAge = df1['Age'].mean()
print(MaleAvgAge)

30.72664459161148

In [149]:
# Male Average Fare
df2 = df.loc[df['Sex']=='male']
MaleAvgFare = df2['Fare'].mean()
print(MaleAvgFare)

25.523893414211418

In [150]:
# Female Average Age
df1 = df.loc[df['Sex']=='female']
FemaleAvgAge = df1['Age'].mean()
print(FemaleAvgAge)

27.915708812260537

In [151]:
# Female Average Fare
df2 = df.loc[df['Sex']=='female']
FemaleAvgFare = df2['Fare'].mean()
print(FemaleAvgFare)

44.47981783439487

### 6. Who was more likely to have survived the disaster, a male or female passenger?

In [152]:
# Male Survival Probability
df1 = df.loc[df['Sex']=='male']
SurvMaleProb = df1['Survived'].mean()
print(SurvMaleProb)

0.18890814558058924

In [153]:
# Female Survival Probability
df1 = df.loc[df['Sex']=='female']
SurvFemaleProb = df1['Survived'].mean()
print(SurvFemaleProb)

0.7420382165605095

In [154]:
#Conclusion
'Female passengers were far more likely to survive the disaster because the female survival probability is much higher than that of male'

'Female passengers were far more likely to survive the disaster because the female survival probability is much higher than that of male'

### 7. What age group had a higher mean fare, those above or below the median age ?

In [155]:
#Below median age mean fare
df3 = df[df.Age < 28]
BelowMedianMeanFare = df3['Fare'].mean()
print(BelowMedianMeanFare)

30.044670919881295

In [156]:
#Above median age mean fare
df3 = df[df.Age > 28]
BelowMedianMeanFare = df3['Fare'].mean()
print(BelowMedianMeanFare)

40.117400284090884

In [157]:
#Conclusion
'We can see that the mean fare of above median age is higher than that of below median age'

'We can see that the mean fare of above median age is higher than that of below median age'

### 8. How many distinct passenger/ticket classes were there?  Use the Pclass column.

In [9]:
df.Pclass.nunique()

3

### 9. Count the rows by Pclass value using groupby.

In [159]:
group = df.groupby('Pclass')
group.count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

### 10. Sort the dataframe by age.

In [160]:
df.sort_values('Age')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S